[
  {
    "name": "Pharmacy Management System",
    "desc": "A comprehensive desktop application developed using C# and .NET Framework. This system features a user-friendly GUI for managing pharmacy operations, including medicine inventory, customer details, and sales transactions. The project focuses on robust database connectivity for seamless data management. It also includes an OTP (One-Time Password) verification system for secure login and critical actions. Ideal for small to medium-sized pharmacies.",
    "image": "pharmacymanagement",
    "category": "csharp",
    "links": {
      "view": "https://github.com/EhsanulHaqueSiam/PharmacyManagementSystem",
      "code": "https://github.com/EhsanulHaqueSiam/PharmacyManagementSystem"
    }
  },
  {
    "name": "Hotel Management System",
    "desc": "A Java-based desktop application designed for efficient hotel management. This project implements a GUI to handle bookings, customer records, and room assignments. A lightweight text file database is used for storing and retrieving information, making it easy to deploy without external database dependencies. The system demonstrates effective implementation of Java features for data handling and user interaction.",
    "image": "hotelmanagement",
    "category": "java",
    "links": {
      "view": "https://github.com/EhsanulHaqueSiam/HotelManagementSystem",
      "code": "https://github.com/EhsanulHaqueSiam/HotelManagementSystem"
    }
  },
  {
    "name": "Student Management System",
    "desc": "A powerful system for managing student information and academic sessions. This project supports both online and offline database configurations, enabling flexibility in data storage and retrieval. It includes features for creating and managing relational databases, handling user sessions, and ensuring efficient SQL-based operations. Perfect for schools, colleges, or any institution managing student data.",
    "image": "studentmanagement",
    "category": "database",
    "links": {
      "view": "https://github.com/EhsanulHaqueSiam/StudentManagementSystem",
      "code": "https://github.com/EhsanulHaqueSiam/StudentManagementSystem"
    }
  },
  {
    "name": "BDNewsPaperScraper",
    "desc": "A web scraping project built using Scrapy, a Python-based framework. This system focuses on extracting news articles and updates from Bangladeshi newspapers, automating the data collection process. The scraper efficiently collects and structures data for further analysis or integration with other applications. It's designed to handle diverse formats and ensure accurate extraction from dynamic web pages.",
    "image": "saas",
    "category": "web_scraping",
    "links": {
      "view": "https://github.com/EhsanulHaqueSiam/BDNewsPaperScraper",
      "code": "https://github.com/EhsanulHaqueSiam/BDNewsPaperScraper"
    }
  },
  {
    "name": "Portfolio",
    "desc": "A personal portfolio website designed to showcase projects, skills, and achievements. This site is built using HTML, CSS, and jQuery, ensuring a responsive and visually appealing layout. Hosted on Netlify for fast and reliable access, the portfolio features smooth navigation, interactive elements, and clean code. It's designed to create a professional online presence and demonstrate web development skills.",
    "image": "portfolioweb",
    "category": "web",
    "links": {
      "view": "https://github.com/EhsanulHaqueSiam/Portfolio_EhsanulHaqueSiam",
      "code": "https://github.com/EhsanulHaqueSiam/Portfolio_EhsanulHaqueSiam"
    }
  }
]
